app/controllers/units_controller.rb

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", :id]]
---
  def show
    if params[:id]
      @unit = Unit.find(params[:id])